fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМК_СуммаЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВМК_ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СоздатьЭлементыАбонентскогоДоговора();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
		ВидимостьДоговораПоТипу();		
	
КонецПроцедуры


&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидДоговораПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	ВидимостьДоговораПоТипу();

КонецПроцедуры

&НаСервере
Процедура ВидимостьДоговораПоТипу() 
	ЭтоАбонентскийДоговор = (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	
		Элементы.ПолеДатаНач.Видимость = ЭтоАбонентскийДоговор;
		Элементы.ПолеДатаОкон.Видимость = ЭтоАбонентскийДоговор;
		Элементы.ПолеСуммаАбон.Видимость = ЭтоАбонентскийДоговор;
		Элементы.ПолеСуммаЧаса.Видимость = ЭтоАбонентскийДоговор;

КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыАбонентскогоДоговора()
	
	ГруппаАбонДог = Элементы.Добавить("ГруппаАбонДог", Тип("ГруппаФормы"));
	ГруппаАбонДог.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАбонДог.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаАбонДог.ОтображатьЗаголовок = Истина;
	ГруппаАбонДог.Заголовок = "Реквизиты абонентского договора";	
	ГруппаАбонДог.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ПолеДатаНач = Элементы.Добавить("ПолеДатаНач", Тип("ПолеФормы"), ГруппаАбонДог);
	ПолеДатаНач.Вид = ВидПоляФормы.ПолеВвода;
	ПолеДатаНач.ПутьКДанным = "Объект.ВМК_ДатаНачалаДоговора";
	
	ПолеДатаОкон = Элементы.Добавить("ПолеДатаОкон", Тип("ПолеФормы"), ГруппаАбонДог);
	ПолеДатаОкон.Вид = ВидПоляФормы.ПолеВвода;
	ПолеДатаОкон.ПутьКДанным = "Объект.ВМК_ДатаОкончанияДоговора";
	
	ПолеСуммаАбон = Элементы.Добавить("ПолеСуммаАбон", Тип("ПолеФормы"), ГруппаАбонДог);
	ПолеСуммаАбон.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСуммаАбон.ПутьКДанным = "Объект.ВМК_СуммаАбонентскойПлаты";
	
	ПолеСуммаЧаса = Элементы.Добавить("ПолеСуммаЧаса", Тип("ПолеФормы"), ГруппаАбонДог);
	ПолеСуммаЧаса.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСуммаЧаса.ПутьКДанным = "Объект.ВМК_СуммаЧасаРаботы";
	
КонецПроцедуры
